{
  "backend/main.mo": "Main Motoko actor implementing the backend with user profiles, factory reset, blob storage, access control, and a spine room system with room creation, joining, and photo management endpoints.",
  "feature_evidence.json": "JSON report documenting feature evidence, specifically detailing a fix for Chrome on Windows falsely reporting camera permission as denied, with tiered getUserMedia retries, Permissions API diagnostics, and a diagnostic panel update.",
  "frontend-file-summaries.txt": "A JSON-formatted text file containing one-to-two sentence summaries of all frontend source files, serving as a reference index for the frontend codebase.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark color themes including background, foreground, chart, and sidebar tokens.",
  "frontend/index.html": "Minimal HTML shell for the Vite/React app, mounting the React root div and loading the main TypeScript entry point as an ES module.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with all application routes, wraps the app in QueryClientProvider, ThemeProvider, and renders a Toaster for notifications.",
  "frontend/src/components/ar-room/ARPhotoGallery.tsx": "Displays a gallery of captured AR photos with actions for downloading, sharing scratch card links, ordering prints via Printrove, and creating trending reels via Shotstack. Includes modals for print order form and reel creation status.",
  "frontend/src/components/ar-room/CameraPermissionGate.tsx": "Handles camera permission flow by querying the Permissions API and attempting getUserMedia across multiple constraint tiers with exponential backoff. Renders browser-specific instructions and UI states (checking, prompt, denied, error) to guide users through granting camera access.",
  "frontend/src/components/ar-room/PerspectiveGrid.tsx": "Renders an SVG perspective grid overlay with converging vertical lines, horizontal lines, and a dashed floor guide line for AR spatial reference.",
  "frontend/src/components/ar-room/VideoAROverlay.tsx": "Main AR overlay component that composites a live environment camera feed with a background-removed remote video, supporting drag-to-position transforms, gesture modes (cheek pulling, flying kiss, heartbeat), Snap Camera Kit effects, MediaPipe body tracking, and photo capture.",
  "frontend/src/components/auth/LoginButton.tsx": "Button component that handles Internet Identity login and logout, showing loading states and using toast notifications for feedback. Handles the 'already authenticated' edge case by clearing the session before retrying login.",
  "frontend/src/components/auth/ProfileSetup.tsx": "Modal dialog that prompts a newly authenticated user to enter their display name and saves it via the caller user profile mutation before proceeding.",
  "frontend/src/components/CameraErrorDisplay.tsx": "Reusable component that renders a styled error alert with browser-specific instructions and a retry button for various camera access failure types (permission, not-found, timeout, etc.).",
  "frontend/src/components/gestures/CheekPullingOverlay.tsx": "Transparent touch overlay that uses the useCheekPulling hook to render a visual deformation circle when the user drags to simulate cheek-pulling on the AR subject.",
  "frontend/src/components/gestures/FlyingKissParticle.tsx": "Renders animated 💋 emoji particles that travel from a start position to an end position based on each particle's progress value.",
  "frontend/src/components/gestures/HeartbeatSyncUI.tsx": "React UI component for heartbeat synchronization that supports both camera-based rPPG detection and a mock device health sensor mode, displaying BPM, confidence, and pulse waveform data.",
  "frontend/src/components/gestures/LipMarkOverlay.tsx": "Renders fading lip-shaped SVG marks at specified positions on screen, with opacity decreasing over 5 seconds based on each mark's timestamp.",
  "frontend/src/components/gestures/SyncDanceReview.tsx": "Side-by-side video review component for synchronized dance recordings, allowing playback, download, and auto-editing into a trending reel via the Shotstack API.",
  "frontend/src/components/gestures/SyncDanceTutorial.tsx": "Dialog component that displays a sync dance tutorial with an optional MediaPipe skeleton overlay for body tracking position guidance, and a button to start recording.",
  "frontend/src/components/gestures/SyncedHeartAnimation.tsx": "Displays a pulsing heart emoji overlay when two users are heartbeat-synced, with animation speed driven by the pulse rate and a fade-out delay on desync.",
  "frontend/src/components/layout/AppLayout.tsx": "Root layout component providing a sticky header with branding and login button, a main content outlet, and a footer with a caffeine.ai attribution link.",
  "frontend/src/components/scratch-card/ScratchCardCanvas.tsx": "Interactive scratch card component that overlays a canvas on a photo, tracks scratch progress percentage, and reveals an optional audio message when fully scratched.",
  "frontend/src/components/shared-room/CameraAngleSelector.tsx": "Simple button group component for selecting between three camera angle modes: stage, side, and group.",
  "frontend/src/components/shared-room/CameraPermissionGate.tsx": "Handles camera permission flow with multi-tier constraint fallbacks, exponential backoff retries, browser-specific instructions for denied states, and persistent permission caching via localStorage.",
  "frontend/src/components/shared-room/CountdownTimer.tsx": "A modal component that lets users choose a 3 or 5 second countdown timer before a photo is captured, displaying a large animated countdown and a cancel button.",
  "frontend/src/components/shared-room/DualCameraView.tsx": "The main camera view component for a shared room that manages local video streaming, photo capture with countdown/shutter effects, gesture overlays (flying kiss, cheek pulling, heartbeat sync), sync dance recording, photo enhancement, and a parchment letter modal.",
  "frontend/src/components/shared-room/InstantDownloads.tsx": "A panel component providing buttons to download the top photo in HD, a behind-the-scenes timelapse reel, and to create a blooper video via the InVideo hook, with a modal showing blooper results.",
  "frontend/src/components/shared-room/ParchmentLetterModal.tsx": "A dialog modal that renders a parchment-styled canvas for freehand letter writing using the Atrament drawing engine, with a countdown timer, clear, and save/download controls.",
  "frontend/src/components/shared-room/PhotoGallery.tsx": "A gallery component displaying local and backend photos with options to export, generate QR codes, create timelapse videos, order prints via Printrove, create trending reels via Shotstack, and share scratch card links.",
  "frontend/src/components/shared-room/ShutterEffect.tsx": "A simple overlay component that flashes a white screen for 300ms to simulate a camera shutter effect when triggered.",
  "frontend/src/components/shared-room/TimelapseViewer.tsx": "A dialog component for playing, downloading, and creating blooper videos from a timelapse Blob, with play/pause controls and an InVideo blooper modal.",
  "frontend/src/components/shared-room/Virtual3DEnvironment.tsx": "Renders a Three.js 3D environment with a floor, lighting, and video texture planes for local and remote participants, supporting multiple camera angles and photo capture.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useARPhotoCapture.ts": "Hook that composites a background video feed with a transformed overlay canvas into a high-resolution JPEG ArrayBuffer for AR photo capture.",
  "frontend/src/hooks/useBackgroundRemoval.ts": "Hook that attempts background removal but falls back to a simple video passthrough, drawing frames from a video element onto a canvas via requestAnimationFrame.",
  "frontend/src/hooks/useCheekPulling.ts": "Hook that tracks touch/mouse drag gestures to compute a deformation intensity and radius for a cheek-pulling face effect.",
  "frontend/src/hooks/useFlyingKiss.ts": "Hook that uses microphone audio analysis to detect blow gestures, animating kiss particles across the screen and leaving temporary lip mark overlays.",
  "frontend/src/hooks/useHeartbeatSync.ts": "Hook that estimates heart rate via rPPG by sampling red/green channel averages from a video feed, with a stub toggle for device health sensor (Google Fit/HealthKit) integration.",
  "frontend/src/hooks/useHowlerAudio.ts": "Hook that lazily loads Howler.js from CDN and exposes play functions for paper-rustle and wax-crack sounds, currently using silent WAV stubs as placeholders.",
  "frontend/src/hooks/useInternetIdentity.ts": "A React context/hook providing Internet Identity authentication via DFINITY's AuthClient, exposing login, logout, identity state, and status flags.",
  "frontend/src/hooks/useInVideoBlooper.ts": "A React hook that simulates creating a blooper video from photos using InVideo AI, currently stubbed with a setTimeout placeholder instead of a real API call.",
  "frontend/src/hooks/useMediaPipeBodyTracking.ts": "A React hook that toggles body tracking and returns mock skeleton joint/connection data, with TODOs to replace it with real MediaPipe Pose landmark detection.",
  "frontend/src/hooks/useParchmentCanvas.ts": "A React hook that loads Atrament.js from CDN to enable freehand drawing on a canvas, with a 2-minute countdown timer that seals the canvas and plays sound effects via Howler.",
  "frontend/src/hooks/usePhotoBlending.ts": "A React hook that uploads a composite image to Adobe Firefly, applies generative fill/blending via the Firefly API, and returns the resulting blended image blob.",
  "frontend/src/hooks/usePhotoCapture.ts": "A React hook that captures JPEG images from a canvas or video element at a minimum resolution, returning the result as an ExternalBlob.",
  "frontend/src/hooks/usePhotoExport.ts": "A React hook that upscales a photo using Claid.ai (with a canvas-based fallback) and triggers a browser download of the resulting HD JPEG.",
  "frontend/src/hooks/usePhotoRelight.ts": "A React hook that sends a photo blob to the Clipdrop Relight API and returns the relighted image blob.",
  "frontend/src/hooks/usePrintroveOrder.ts": "React hook for submitting print orders to the Printrove API. Currently stubs the API call with a console log and simulated delay, with a TODO to replace it with a real fetch request using VITE_PRINTROVE_API_KEY.",
  "frontend/src/hooks/useQRCodeGenerator.ts": "React hook that dynamically loads the qrcode library from CDN and generates a QR code data URL from a given URL string, exposing loading and error states.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for interacting with the backend actor, covering user profiles, room management (create/delete/verify), photo retrieval, and photo capture mutations.",
  "frontend/src/hooks/useScratchCard.ts": "React hook implementing a scratch-card interaction on an HTML canvas, tracking scratch percentage and triggering a revealed state when a configurable threshold is reached, with mouse and touch support.",
  "frontend/src/hooks/useShotstackReel.ts": "React hook for creating a trending video reel via the Shotstack API. Currently stubs the API call with a console log and simulated delay, with a TODO to implement the real render-and-poll flow using VITE_SHOTSTACK_API_KEY.",
  "frontend/src/hooks/useSnapCameraKit.ts": "React hook that stubs Snap Camera Kit integration, providing toggle and lens-apply functions that currently only log to the console, with TODOs to bind the real Snap SDK using VITE_SNAP_API_TOKEN and VITE_SNAP_LENS_GROUP_ID.",
  "frontend/src/hooks/useSyncDanceRecording.ts": "React hook that simultaneously records local and optional remote MediaStreams for 15 seconds with a countdown, then exposes the resulting video Blobs for both streams.",
  "frontend/src/hooks/useTimelapseGenerator.ts": "React hook that generates a WebM timelapse video from an array of photos using canvas rendering and MediaRecorder, with progress tracking, auto-generation trigger, and a download helper.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives and defines a warm color palette (amber, coral, teal) using OKLCH CSS variables for both light and dark modes, plus custom utility classes for those colors.",
  "frontend/src/main.tsx": "React app entry point that mounts the app with QueryClientProvider for React Query and InternetIdentityProvider for ICP authentication.",
  "frontend/src/pages/ARRoomPresencePage.tsx": "AR room page that gates camera access, then provides a UI for AR video overlay, photo gallery, and a synchronized dance recording feature with tutorial and review flows.",
  "frontend/src/pages/CreateRoomPage.tsx": "Page with a form to create a named room, polling for backend actor readiness with retries and navigating to the new room on success.",
  "frontend/src/pages/LandingPage.tsx": "Marketing landing page showcasing TogetherFrame's features (cheek pulling, flying kiss, sync dance, photo capture, etc.) with a hero image, feature cards, and navigation to create/join a room.",
  "frontend/src/pages/ScratchCardPage.tsx": "Page that reads a photo URL from the URL hash and renders an interactive scratch-card canvas to reveal the photo, with an error state if no photo data is found.",
  "frontend/src/pages/SharedVirtualRoomPage.tsx": "Shared virtual room page that verifies the user is the room creator, gates camera access, and renders a dual-camera view with angle selection and a photo gallery.",
  "frontend/src/pages/TimelapsePlayerPage.tsx": "A React page that reads a video URL from the URL hash, displays it in a video player, and provides play/pause and download controls. Shows an error state if no valid video URL is found.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from query strings and hash-based routes, with helpers for persisting values to sessionStorage and cleaning sensitive params from the URL bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with oklch-based design tokens, custom border radii, accordion keyframes, and Inter font, plus typography, container-queries, and animate plugins.",
  "project_state.json": "Project state snapshot (version 41) describing a Real-Time Virtual Presence web app with shared virtual room and AR modes, tracking existing features, known issues, and architectural notes."
}